<%@ Page Language="C#" AutoEventWireup="true" Title="СДН :: Довідка" MasterPageFile="~/MasterPage.Master"
    CodeBehind="Help.aspx.cs" Inherits="ELMS13.Help" %>

<%@ Register Assembly="AjaxControlToolkit" Namespace="AjaxControlToolkit" TagPrefix="cc1" %>
<asp:Content ID="Content1" ContentPlaceHolderID="cphSide1" runat="Server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="cphMainContent" runat="Server">
    <cc1:ToolkitScriptManager runat="server" ID="ajsm" />
    <div id="master_content">
        <cc1:Accordion ID="MyAccordion" runat="server" SelectedIndex="0" HeaderCssClass="accordionHeader"
            HeaderSelectedCssClass="accordionHeaderSelected" ContentCssClass="accordionContent"
            FadeTransitions="True" FramesPerSecond="40" TransitionDuration="150" AutoSize="None"
            RequireOpenedPane="false" SuppressHeaderPostbacks="true">
            <Panes>
                <cc1:AccordionPane ID="AccordionPane1" runat="server">
                    <Header>
                        <a href="" class="accordionLink">1. Про довідкову систему</a></Header>
                    <Content>
                        <p>
                            У розділах довідкової системи ви знайдете відповіді на питання щодо:</p>
                        <ul class="list">
                            <li>Навігації по інтерфейсу порталу та його структурі</li>
                            <li>Як зареєструватися у системі та що робити, якщо ви втратили пароль</li>
                            <li>Як зареєструватися на дистанційному курсі</li>
                            <li>Як відрахувати себе з дистанційного курсу</li>
                            <li>Як навчатися на курсі</li>
                            <li>Як переглянути звітність про успішність на курсі</li>
                        </ul>
                    </Content>
                </cc1:AccordionPane>
                <cc1:AccordionPane ID="AccordionPane2" runat="server">
                    <Header>
                        <a href="" class="accordionLink">2. Навігація</a></Header>
                    <Content>
                        <p>
                            Для навігації по порталу призначене меню, що знаходиться зверху. Призначення основних
                            пунктів:</p>
                        <ul class="list">
                            <li>"Головна": головна сторінка порталу.</li>
                            <li>"Курси": каталог курсів, доступних у системі(з описом курсів).</li>
                            <li>"Довідка": довідкова система.</li>
                            <li>"Контакти": контактна інформація для відвідувачів порталу.</li>
                            <li>"Про систему": інформація про систему.</li>
                            <li>"Вхід": сторінка входу до системи.</li>
                            <li>"Реєстрація": сторінка реєстрації в системі.</li>
                        </ul>
                        <p>
                            Після того, як ви зареєструвалися і ввійшли у систему, вам буде доступний пункт
                            меню "Приватна кімната". Після переходу в приватну область ліворуч вам будуть доступні
                            такі пункти меню:</p>
                        <ul class="list">
                            <li>"Мої курси": каталог курсів, їх стан (Запуск, Відрахування, Реєстрація, Недоступний).</li>
                            <li>"Мій профайл": дані про вашу персону.</li>
                            <li>"Змінити пароль": сервіс зміни пароля.</li>
                        </ul>
                    </Content>
                </cc1:AccordionPane>
                <cc1:AccordionPane ID="AccordionPane3" runat="server">
                    <Header>
                        <a href="" class="accordionLink">3. Реєстрація і вхід у систему. Відновлення пароля.</a></Header>
                    <Content>
                        <p>
                            Реєстрація в системі. Для реєстрації необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Реєстрація"</li>
                            <li>2. Ввести логін (бажано латинськими літерами) у полі "Ім'я входу"</li>
                            <li>3. Ввести та повторити пароль у відповідних полях форми реєстрації (не менше 7 знаків,
                                бажано латиньськими літерами)</li>
                            <li>4. Ввести ваш e-mail адрес</li>
                            <li>5. Ввести секретне питання та секретну відповідь на питання (інформація для відновлення
                                пароля при його втраті)</li>
                            <li>6. Ввести код захисту з картинки, що знаходиться нижче</li>
                            <li>7. Натиснути кнопку "Зареєструвати"</li>
                        </ul>
                        Якщо ви помилилися при введенні даних чи не ввели дані в поля, то після натискання
                        кнопки "Зареєструвати" буде видано повідомлення про помилку та відповідне поле ліворуч
                        буде помічене знаком [<b style="color: Red">*</b>].
                        <p>
                            Вхід у систему. Для входу необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Вхід"</li>
                            <li>2. Ввести логін у полі "Ім'я входу"</li>
                            <li>3. Ввести пароль у відповідному полі</li>
                            <li>4. Натиснути кнопку "Вхід"</li>
                        </ul>
                        <p>
                            Відновлення пароля. Для відновлення пароля необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Вхід"</li>
                            <li>2. Під кнопкою Вхід натиснути лінк "Забули пароль?"</li>
                            <li>3. Введіть "Ім'я входу" та натисніть кнопку "Ок"</li>
                            <li>4. Введіть відповідь на секретне питання і натисніть кнопку "Ок". На вашу поштову
                                скриньку буде вислано новий пароль.</li>
                        </ul>
                        (!) Старий пароль не може бути вислано, тому що паролі зберігаються в системі у
                        зашифрованому вигляді.
                    </Content>
                </cc1:AccordionPane>
                <cc1:AccordionPane ID="AccordionPane4" runat="server">
                    <Header>
                        <a href="" class="accordionLink">4. Реєстрація/відрахування на курсі</a></Header>
                    <Content>
                        <p>
                            <b>Реєстрація на курсі.</b> Якщо Адміністратор встановив для курсу можливість самореєстрації,
                            то Ви зможете зарахувати самого себе на курс. Для реєстрації необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Приватна кімната"</li>
                            <li>2. У приватній кімнаті ліворуч обрати "Мої курси"</li>
                            <li>3. У переліку доступних курсів вибрати той, що вас цікавить і натиснути праворуч
                                напроти курсу лінк "Реєстрація"</li>
                        </ul>
                        <p>
                            <b>Відрахування з курсу.</b> Якщо Адміністратор встановив для курсу можливість самовідрахування,
                            то Ви зможете відрахувати самого себе з курсу. Будьте уважні - вся інформацію щодо
                            результатів проходження цього курсу буде знищено. Для відрахування необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Приватна кімната"</li>
                            <li>2. У приватній кімнаті ліворуч обрати "Мої курси"</li>
                            <li>3. Напроти курсу натиснути праворуч лінк "Відрахування"</li>
                        </ul>
                    </Content>
                </cc1:AccordionPane>
                <cc1:AccordionPane ID="AccordionPane5" runat="server">
                    <Header>
                        <a href="" class="accordionLink">5. Навчання на курсі</a></Header>
                    <Content>
                        <p>
                            <b>Навчання на курсі.</b> Для навчання необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Приватна кімната"</li>
                            <li>2. У приватній кімнаті ліворуч обрати "Мої курси"</li>
                            <li>3. Напроти курсу натиснути праворуч лінк "Запуск"</li>
                        </ul>
                        У вікні, що з'явиться, ліворуч ви побачете "дерево" курсу. Після кліку по назві
                        заняття відображається зміст заняття. Для завершення заняття необхідно зверху натиснути
                        лінк "Завершити заняття". Для переходу в каталог курсів натисніть лінк "В каталог
                        курсів".<br />
                    </Content>
                </cc1:AccordionPane>
                <cc1:AccordionPane ID="AccordionPane6" runat="server">
                    <Header>
                        <a href="" class="accordionLink">6. Звітність</a></Header>
                    <Content>
                        Як Слухач ви можете отримати лише один звіт щодо вашої успішності на курсі.<br />
                        <p>
                            Для отримання звіту необхідно:</p>
                        <ul class="list">
                            <li>1. Обрати пункт меню "Приватна кімната"</li>
                            <li>2. У приватній кімнаті ліворуч обрати "Мої курси"</li>
                            <li>3. Напроти курсу натиснути праворуч лінк "Запуск"</li>
                            <li>4. Нижче "дерева" курсу натисніть кнопку "Звіт про мій прогрес"</li>
                        </ul>
                    </Content>
                </cc1:AccordionPane>
            </Panes>
        </cc1:Accordion>
    </div>
</asp:Content>
<asp:Content ID="Content3" ContentPlaceHolderID="cphSide2" runat="Server">
</asp:Content>
